core-service/src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:f="http://www.okon.com/okon/products">

	<soapenv:Header/>
	<soapenv:Body>
		<f:getProductsRequest/>
	</soapenv:Body>
</soapenv:Envelope>